// Напишите программу, 
//которая задаёт массив из 8 элементов и выводит их на экран.

// Создаем массив из 8 элементов
        int[] numbers = new int[8] { 1, 2, 3, 4, 5, 6, 7, 8 };

        // Выводим элементы массива на экран
        foreach (int number in numbers)
        {
            Console.WriteLine(number);
        }

        Console.ReadLine();
